InformationRegisters/омг_ОшибкиОтправкиЗаявокЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>омг_ОшибкиОтправкиЗаявокЛИС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Архивная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_ЖурналЗапросовПоЗаявкамЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>омг_ЖурналЗапросовПоЗаявкамЛИС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Детали</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ТипыЗапросовЛИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>омг_СтатусыЗаякиНаЛабИсследованиеВЛИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаВЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученРезультатИзЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученЧастичныйРезультатИзЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьБракованныеПробы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/омг_ТипыЗапросовЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>омг_ТипыЗапросовЛИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаборБиоматериалов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеБланков</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры/Ext/Module.bsl
Функция ОтправитьЗаявкуВЛИС(Заявка) Экспорт
	
	Возврат омг_ИнтеграцияСЛИС.СоздатьЗаявкуВЛИСИПолучитьКонтейнеры(Заявка);
	
КонецФункции

Процедура ОбновитьСостояниеПоДаннымЛИСНаСервере(Заявка) Экспорт	
	
	омг_ИнтеграцияСЛИС.ОбновлениеСостоянияОтправленныхЗаявокВЛИС(Заявка);
	
КонецПроцедуры

Функция ПолучитьТекущегоСотрудника() Экспорт
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ТекущийПользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Сотрудник;
	
КонецФункции

Функция ПолучитьСостояниеПоЗаявке(Заявка) Экспорт
	
	СостояниеПоЗаявке = Новый Структура("Доступна, Завершено, ПолученыБланки", Ложь, Ложь, Ложь);
	
	СоответствиеЗаявок = омг_ИнтеграцияСЛИС.ПроверитьСтатусЗаявкиВЛИС(Заявка, Истина);
	
	ДанныеПоЗаявке = СоответствиеЗаявок.Получить(Заявка);
	
	СостояниеПоЗаявке.Доступна = Не ДанныеПоЗаявке = Неопределено;
	
	Если СостояниеПоЗаявке.Доступна Тогда
		СостояниеПоЗаявке.Завершено = ДанныеПоЗаявке.Завершено;
		
		Для Каждого ДанныеБланка ИЗ ДанныеПоЗаявке.Бланки Цикл
			Если ДанныеБланка.Выполнено Тогда
				СостояниеПоЗаявке.ПолученыБланки = ДанныеБланка.Выполнено;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СостояниеПоЗаявке;
	
КонецФункции

Функция ВыполненаОтменаЗаявки(Заявка) Экспорт
	
	СоответствиеЗаявок = омг_ИнтеграцияСЛИС.СоздатьЗаявкуВЛИСИПолучитьКонтейнеры(Заявка, Истина);
	СтруктураЗаявки = СоответствиеЗаявок.Получить(Заявка);
	Если Не СтруктураЗаявки = Неопределено Тогда
		Если СтруктураЗаявки.Свойство("Ошибки") И СтруктураЗаявки.Ошибки.Количество() = 0 Тогда
			ДокументЗаявка = Заявка.ПолучитьОбъект();
			ДокументЗаявка.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Отменена;
			СтрокаЖурнала = ДокументЗаявка.Журнал.Добавить();
			СтрокаЖурнала.Детали = омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ПолучитьХранилищеЗначенияТекстовЗапросаОтправкиВЛИС(СтруктураЗаявки.ТелоЗапроса, СтруктураЗаявки.ТелоОтвета);
			ДокументЗаявка.Записать();
			Возврат Истина
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьХранилищеЗначенияТекстовЗапросаОтправкиВЛИС(ТелоЗапроса, ТелоОтвета) Экспорт
	
	Возврат Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(Новый Структура("ТекстЗапроса, ТекстОтвета", 
				ТелоЗапроса, ТелоОтвета)), Новый СжатиеДанных(9));
	
КонецФункции

Процедура УстановитьСтатусОтменыНеотправленнойЗаявки(Заявка) Экспорт
	
	ДокументЗаявка = Заявка.ПолучитьОбъект();
	ДокументЗаявка.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Отменена;
	ДокументЗаявка.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьНовыеОшибкиПоЗаявке(Заявка, Ошибки) Экспорт
	
	НаборЗаписей = РегистрыСведений.омг_ОшибкиОтправкиЗаявокЛИС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.Архивная = Истина;
	КонецЦикла;
	
	ТекущаяДата = ТекущаяДата();
	
	СчетчикСекунд = 0;
	Для Каждого Ошибка Из Ошибки Цикл
		СчетчикСекунд = СчетчикСекунд + 1;
		Запись = НаборЗаписей.Добавить();
		Запись.Заявка = Заявка;
		Запись.ТекстОшибки = Ошибка;
		Запись.Период = ТекущаяДата + СчетчикСекунд;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьЖурналПоЗаявке(Заявка, ТелоЗапроса, ТелоОтвета, ТипЗапроса = Неопределено) Экспорт
	
	Запись = РегистрыСведений.омг_ЖурналЗапросовПоЗаявкамЛИС.СоздатьМенеджерЗаписи();
	Запись.Заявка = Заявка;
	Если ТипЗапроса = Неопределено Тогда
		Запись.ТипЗапроса = Перечисления.омг_ТипыЗапросовЛИС.ЗаборБиоматериалов;
	Иначе
		Запись.ТипЗапроса = ТипЗапроса;
	КонецЕсли;
	Запись.Детали = ПолучитьХранилищеЗначенияТекстовЗапросаОтправкиВЛИС(ТелоЗапроса, ТелоОтвета);
	Запись.Период = ТекущаяДата();
	Запись.Записать();
	
КонецПроцедуры

Функция БиоматериалыУчаствующиеВУШК(ИсходныйМассивДанных, МассивЗаявок) Экспорт
	
	МассивБиоматериалов = Новый Массив;
	
	Для Каждого ДанныеБиоматериала Из ИсходныйМассивДанных Цикл
		
		МассивБиоматериалов.Добавить(ДанныеБиоматериала.Биоматериал);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОказаниеУслуг.Филиал КАК Филиал
	               |ИЗ
	               |	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	               |ГДЕ
	               |	ОказаниеУслуг.Ссылка В(&МассивЗаявок)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка В(&МассивЗаявок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВнутренняяЛаборатория_Биоматериалы.Ссылка КАК Ссылка,
	               |	ВнутренняяЛаборатория_Биоматериалы.омг_УчаствуетВУШК КАК омг_УчаствуетВУШК
	               |ИЗ
	               |	Справочник.ВнутренняяЛаборатория_Биоматериалы КАК ВнутренняяЛаборатория_Биоматериалы
	               |ГДЕ
	               |	ВнутренняяЛаборатория_Биоматериалы.Ссылка В(&МассивБиоматериалов)
	               |	И ВнутренняяЛаборатория_Биоматериалы.омг_УчаствуетВУШК";
	Запрос.УстановитьПараметр("МассивБиоматериалов", МассивБиоматериалов);
	Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	Выборка = ПакетРезультатов.Получить(0).Выбрать();
	
	ДанныеФилиалов = омг_ИнтеграцияСЛИС.ПолучитьДополнительныеНастройкиПоФилиалам(Истина);
	
	ЕстьУШК = Ложь;
	Пока Выборка.Следующий() Цикл
		ДанныеФилиала = ДанныеФилиалов.Получить(Выборка.Филиал);
		Если Не ДанныеФилиала = Неопределено И ДанныеФилиала.Свойство("ИспользуетсяУникальноеШтрихкодирование")
			И ДанныеФилиала.ИспользуетсяУникальноеШтрихкодирование = Истина Тогда
			ЕстьУШК = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьУШК Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Выборка = ПакетРезультатов.Получить(1).Выбрать();
	МассивБиоматериалов.Очистить();
	Пока Выборка.Следующий() Цикл
		МассивБиоматериалов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивБиоматериалов;
	
КонецФункции
